БухЭксп/InformationRegisters/CW_ДоступныеОбъектыСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ДоступныеОбъектыСогласования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОбъектаМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ДоступныеОбъектыСогласования/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ЗаписатьДоступныеОбъектыМетаданных(мОбъекты) Экспорт
	
	Набор = РегистрыСведений.CW_ДоступныеОбъектыСогласования.СоздатьНаборЗаписей();
	Набор.Прочитать();
	Набор.Очистить();
	
	Для Каждого ЭлементМассива из мОбъекты Цикл
		СтрокаНабора = Набор.Добавить();
		СтрокаНабора.ИдентификаторОбъектаМетаданных = ЭлементМассива;
		СтрокаНабора.Используется = Истина;
	КонецЦикла;
	
	Набор.Записать();
	
КонецПроцедуры

Функция ПроверитьДоступностьОбъектаМетаданных(ТипОбъекта) Экспорт 
	
	ИдетифкаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипОбъекта);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ДоступныеОбъектыСогласования.ИдентификаторОбъектаМетаданных КАК ИдентификаторОбъектаМетаданных
	               |ИЗ
	               |	РегистрСведений.CW_ДоступныеОбъектыСогласования КАК CW_ДоступныеОбъектыСогласования
	               |ГДЕ
	               |	CW_ДоступныеОбъектыСогласования.ИдентификаторОбъектаМетаданных = &ИдетифкаторОбъекта";
	
	Запрос.УстановитьПараметр("ИдетифкаторОбъекта", ИдетифкаторОбъекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

#КонецЕсли
